Запишите в файл
```
Assalomu alaykum
```

---

Запишите в файл последовательность
```
0 1 2 ... 100
```

---

Считайте из файла последовательность и выведите ее
```
0 1 2 ... 20
```

---

Считайте из файла последовательность и выведите ее
```
0
1
2
3
...
...
20
```

---

Добавьте текстовый файл с таким содержанием
```
0 1 2 ... 20
```
И напишите питоновскую программу, которая сложит все числа в нем.

---

Попросите у пользователя ввести заметку и запишите ее в файл. Допустим, если он введет "отжаться 40 раз", то вы должны записать это в файл.

---

Попросите у пользователя ввести 10 заметок и запишите их в файл

---

Просите у пользователя ввести заметки и пишите их в файл и не останавливайтесь.
Если пользователь введет to'xtash, то остановите программу.

---

Напишите функцию которая ищет максимальное число в списке
```
def engKatta(royxat):
  ...
  ...
  return engKattaSon
```
Импортируйте ее из другого .py файла и используйте.

---

Испробуйте этот код. `.forward` двигает черепаху вперед, `.left` поворачивает ее влево на определенное число градусов.
```
import turtle
wn = turtle.Screen()
toshmat = turtle.Turtle()

toshmat.forward(150)
toshmat.left(90)
toshmat.forward(75)

turtle.done()
```

Теперь добавьте текстовый файл с таким содержанием
```
0 100
90 100
90 100
90 100
135 140
90 70
90 70
90 140
```
Используя черепаху нарисуйте картику, которая будет соотвествовать данным в текстовом файле. Первое число в каждой строке - градусы
на которые должна повернуться черепаха, второе число - расстояние, которое она должна пройти.  
В результате черепаха должна нарисовать
домик.

---

Попросите у пользователя ввести имя и номер телефона и запишите их в файл в формате json


JSON - превращает словарь либо список в строку (с кучей скобок и кавычек). И также превращает строку с кучей скобок и 
кавычек в словарь либо строку. JSON можно использовать чтобы хранить словари или списки в текстовых файлах.  
Пример работы с json.
```
import json

# превратить словарь в строку
print(json.dumps({'salom': 48486484}))

# превратить строку в словарь
print(json.loads('{"salom": 8908465}'))

```
---

Попросите у пользователя ввести имя и вытащите номер телефона из файла в формате json

---

Напишите программу которая находит самую дешевую машину в файле с форматом json
